benchmark/results/throughput_mc-vs-rust/RAW/actix_web-plaintext-throughput_mc-run5.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 1.264ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.256ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.285ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.263ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.271ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.277ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.303ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.285ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26ms  642.30us   9.65ms   69.22%
    Req/Sec    31.41k     2.59k   40.56k    70.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.20ms
 75.000%    1.66ms
 90.000%    2.09ms
 99.000%    2.80ms
 99.900%    6.37ms
 99.990%    8.81ms
 99.999%    9.30ms
100.000%    9.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.021     0.000000            1         1.00
       0.509     0.100000       474728         1.11
       0.705     0.200000       945484         1.25
       0.872     0.300000      1419838         1.43
       1.031     0.400000      1891073         1.67
       1.195     0.500000      2364873         2.00
       1.281     0.550000      2601644         2.22
       1.368     0.600000      2836142         2.50
       1.460     0.650000      3074018         2.86
       1.556     0.700000      3309510         3.33
       1.661     0.750000      3545979         4.00
       1.718     0.775000      3664146         4.44
       1.779     0.800000      3781894         5.00
       1.845     0.825000      3899595         5.71
       1.918     0.850000      4017446         6.67
       2.000     0.875000      4136405         8.00
       2.044     0.887500      4194662         8.89
       2.093     0.900000      4255656        10.00
       2.143     0.912500      4312675        11.43
       2.201     0.925000      4372051        13.33
       2.267     0.937500      4431391        16.00
       2.303     0.943750      4460319        17.78
       2.343     0.950000      4490068        20.00
       2.387     0.956250      4520083        22.86
       2.435     0.962500      4549673        26.67
       2.489     0.968750      4578991        32.00
       2.521     0.971875      4594066        35.56
       2.555     0.975000      4608791        40.00
       2.593     0.978125      4623349        45.71
       2.635     0.981250      4637887        53.33
       2.685     0.984375      4652713        64.00
       2.713     0.985938      4659881        71.11
       2.745     0.987500      4667188        80.00
       2.781     0.989062      4674647        91.43
       2.821     0.990625      4682056       106.67
       2.869     0.992188      4689473       128.00
       2.895     0.992969      4692951       142.22
       2.927     0.993750      4696687       160.00
       2.963     0.994531      4700347       182.86
       3.007     0.995313      4704004       213.33
       3.065     0.996094      4707679       256.00
       3.103     0.996484      4709531       284.44
       3.153     0.996875      4711405       320.00
       3.223     0.997266      4713212       365.71
       3.363     0.997656      4715063       426.67
       3.653     0.998047      4716905       512.00
       3.903     0.998242      4717826       568.89
       4.247     0.998437      4718752       640.00
       4.727     0.998633      4719669       731.43
       5.507     0.998828      4720594       853.33
       6.455     0.999023      4721520      1024.00
       6.799     0.999121      4721979      1137.78
       7.071     0.999219      4722437      1280.00
       7.347     0.999316      4722899      1462.86
       7.587     0.999414      4723361      1706.67
       7.811     0.999512      4723825      2048.00
       7.931     0.999561      4724053      2275.56
       8.043     0.999609      4724283      2560.00
       8.171     0.999658      4724520      2925.71
       8.295     0.999707      4724754      3413.33
       8.407     0.999756      4724986      4096.00
       8.463     0.999780      4725105      4551.11
       8.519     0.999805      4725206      5120.00
       8.591     0.999829      4725332      5851.43
       8.655     0.999854      4725450      6826.67
       8.727     0.999878      4725559      8192.00
       8.775     0.999890      4725616      9102.22
       8.815     0.999902      4725668     10240.00
       8.871     0.999915      4725727     11702.86
       8.927     0.999927      4725793     13653.33
       8.975     0.999939      4725854     16384.00
       8.999     0.999945      4725882     18204.44
       9.031     0.999951      4725901     20480.00
       9.071     0.999957      4725928     23405.71
       9.103     0.999963      4725961     27306.67
       9.135     0.999969      4725985     32768.00
       9.151     0.999973      4726000     36408.89
       9.167     0.999976      4726014     40960.00
       9.183     0.999979      4726031     46811.43
       9.207     0.999982      4726046     54613.33
       9.223     0.999985      4726057     65536.00
       9.255     0.999986      4726069     72817.78
       9.263     0.999988      4726074     81920.00
       9.303     0.999989      4726082     93622.86
       9.311     0.999991      4726087    109226.67
       9.327     0.999992      4726094    131072.00
       9.343     0.999993      4726099    145635.56
       9.351     0.999994      4726102    163840.00
       9.375     0.999995      4726104    187245.71
       9.415     0.999995      4726111    218453.33
       9.415     0.999996      4726111    262144.00
       9.423     0.999997      4726113    291271.11
       9.439     0.999997      4726115    327680.00
       9.455     0.999997      4726118    374491.43
       9.471     0.999998      4726119    436906.67
       9.487     0.999998      4726120    524288.00
       9.535     0.999998      4726121    582542.22
       9.559     0.999998      4726122    655360.00
       9.567     0.999999      4726123    748982.86
       9.575     0.999999      4726125    873813.33
       9.575     0.999999      4726125   1048576.00
       9.575     0.999999      4726125   1165084.44
       9.583     0.999999      4726126   1310720.00
       9.583     0.999999      4726126   1497965.71
       9.599     0.999999      4726127   1747626.67
       9.599     1.000000      4726127   2097152.00
       9.599     1.000000      4726127   2330168.89
       9.631     1.000000      4726128   2621440.00
       9.631     1.000000      4726128   2995931.43
       9.631     1.000000      4726128   3495253.33
       9.631     1.000000      4726128   4194304.00
       9.631     1.000000      4726128   4660337.78
       9.655     1.000000      4726129   5242880.00
       9.655     1.000000      4726129          inf
#[Mean    =        1.263, StdDeviation   =        0.642]
#[Max     =        9.648, Total count    =      4726129]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7127932 requests in 30.00s, 0.86GB read
Requests/sec: 237595.46
Transfer/sec:     29.46MB