benchmark/results/throughput_mc-vs-rust/RAW/axum-plaintext-throughput_mc-run3.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 1.309ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.307ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.307ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.321ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.321ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.324ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.318ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.328ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms  579.26us  14.29ms   67.54%
    Req/Sec    23.87k     1.63k   43.00k    71.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.28ms
 75.000%    1.67ms
 90.000%    2.07ms
 99.000%    2.79ms
 99.900%    3.25ms
 99.990%    6.81ms
 99.999%   12.80ms
100.000%   14.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.029     0.000000            1         1.00
       0.572     0.100000       359628         1.11
       0.783     0.200000       719440         1.25
       0.970     0.300000      1077276         1.43
       1.133     0.400000      1435737         1.67
       1.282     0.500000      1796467         2.00
       1.354     0.550000      1975806         2.22
       1.426     0.600000      2154068         2.50
       1.502     0.650000      2335259         2.86
       1.581     0.700000      2513177         3.33
       1.669     0.750000      2692653         4.00
       1.718     0.775000      2782952         4.44
       1.771     0.800000      2872718         5.00
       1.829     0.825000      2961380         5.71
       1.896     0.850000      3051492         6.67
       1.974     0.875000      3140695         8.00
       2.020     0.887500      3186170         8.89
       2.069     0.900000      3231445        10.00
       2.121     0.912500      3276202        11.43
       2.181     0.925000      3321182        13.33
       2.251     0.937500      3365730        16.00
       2.289     0.943750      3387349        17.78
       2.331     0.950000      3409696        20.00
       2.377     0.956250      3432184        22.86
       2.429     0.962500      3455098        26.67
       2.485     0.968750      3477010        32.00
       2.517     0.971875      3488327        35.56
       2.553     0.975000      3500000        40.00
       2.589     0.978125      3510873        45.71
       2.631     0.981250      3522255        53.33
       2.679     0.984375      3533402        64.00
       2.705     0.985938      3538883        71.11
       2.735     0.987500      3544488        80.00
       2.769     0.989062      3550122        91.43
       2.805     0.990625      3555547       106.67
       2.849     0.992188      3561305       128.00
       2.873     0.992969      3564027       142.22
       2.899     0.993750      3566748       160.00
       2.929     0.994531      3569680       182.86
       2.961     0.995313      3572337       213.33
       3.001     0.996094      3575227       256.00
       3.023     0.996484      3576635       284.44
       3.047     0.996875      3578031       320.00
       3.071     0.997266      3579401       365.71
       3.099     0.997656      3580795       426.67
       3.129     0.998047      3582159       512.00
       3.147     0.998242      3582858       568.89
       3.167     0.998437      3583565       640.00
       3.191     0.998633      3584300       731.43
       3.219     0.998828      3584981       853.33
       3.253     0.999023      3585660      1024.00
       3.275     0.999121      3586024      1137.78
       3.297     0.999219      3586369      1280.00
       3.327     0.999316      3586710      1462.86
       3.363     0.999414      3587060      1706.67
       3.401     0.999512      3587404      2048.00
       3.425     0.999561      3587592      2275.56
       3.455     0.999609      3587757      2560.00
       3.495     0.999658      3587934      2925.71
       3.541     0.999707      3588105      3413.33
       3.601     0.999756      3588280      4096.00
       3.639     0.999780      3588365      4551.11
       3.687     0.999805      3588453      5120.00
       3.775     0.999829      3588540      5851.43
       4.091     0.999854      3588629      6826.67
       5.711     0.999878      3588715      8192.00
       6.335     0.999890      3588759      9102.22
       6.991     0.999902      3588803     10240.00
       7.555     0.999915      3588848     11702.86
       8.239     0.999927      3588891     13653.33
       8.999     0.999939      3588934     16384.00
       9.335     0.999945      3588956     18204.44
       9.711     0.999951      3588980     20480.00
      10.119     0.999957      3589000     23405.71
      10.527     0.999963      3589022     27306.67
      11.103     0.999969      3589044     32768.00
      11.279     0.999973      3589055     36408.89
      11.559     0.999976      3589066     40960.00
      11.871     0.999979      3589078     46811.43
      12.039     0.999982      3589088     54613.33
      12.287     0.999985      3589099     65536.00
      12.359     0.999986      3589104     72817.78
      12.527     0.999988      3589110     81920.00
      12.711     0.999989      3589115     93622.86
      12.951     0.999991      3589121    109226.67
      13.079     0.999992      3589127    131072.00
      13.175     0.999993      3589129    145635.56
      13.231     0.999994      3589133    163840.00
      13.239     0.999995      3589134    187245.71
      13.335     0.999995      3589137    218453.33
      13.375     0.999996      3589140    262144.00
      13.479     0.999997      3589141    291271.11
      13.783     0.999997      3589143    327680.00
      13.791     0.999997      3589144    374491.43
      13.815     0.999998      3589145    436906.67
      13.967     0.999998      3589147    524288.00
      13.967     0.999998      3589147    582542.22
      14.103     0.999998      3589148    655360.00
      14.151     0.999999      3589149    748982.86
      14.151     0.999999      3589149    873813.33
      14.175     0.999999      3589150   1048576.00
      14.175     0.999999      3589150   1165084.44
      14.207     0.999999      3589151   1310720.00
      14.207     0.999999      3589151   1497965.71
      14.207     0.999999      3589151   1747626.67
      14.287     1.000000      3589152   2097152.00
      14.287     1.000000      3589152   2330168.89
      14.287     1.000000      3589152   2621440.00
      14.287     1.000000      3589152   2995931.43
      14.287     1.000000      3589152   3495253.33
      14.295     1.000000      3589153   4194304.00
      14.295     1.000000      3589153          inf
#[Mean    =        1.308, StdDeviation   =        0.579]
#[Max     =       14.288, Total count    =      3589153]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5412822 requests in 30.00s, 671.07MB read
Requests/sec: 180430.25
Transfer/sec:     22.37MB